backend/loadtest-health.yml
config:
  target: "http://localhost:4000"
  phases:
    - duration: 20
      arrivalRate: 5
      name: "Warm-up 5 req/s"
    - duration: 20
      arrivalRate: 15
      name: "Charge 15 req/s"
    - duration: 20
      arrivalRate: 30
      name: "Stress 30 req/s"

scenarios:
  - name: "GET /health"
    flow:
      - get:
          url: "/health"